app/views/st_score/home.html.erb

    <% mn = 0 %>
    <%@student.score.each do |s|%>
---
SELECT "scores".* FROM "scores" WHERE "scores"."student_id" = ?  [["student_id", 1]]